ycsb.org
#+OPTIONS: ^:nil

* Testbed
:PROPERTIES:
:ARCHIVE_TIME: 2023-02-25 Sat 18:40
:ARCHIVE_FILE: ~/Documents/scripts/ycsb.org
:ARCHIVE_CATEGORY: ycsb
:END:

| OS         | Windows10 x86_64                                                                                                                        |
| CPU        | AMD Ryzen 5 5600 @ 3892.7MHz                                                                                                            |
| MEM        | DDR4 16G 3200MHz                                                                                                                        |
| Filesystem | NTFS                                                                                                                                    |
| Disk       | PCIE3.0 NVMe SSD (73000 4K RANDOM WRITE IOPS ; 300MB/s 256K RANDOM WRITE BW ; 30000 4K RANDOM READ IOPS ; 1300MB/s 256K RANDOM READ BW) |
| Repo       | [[https://github.com/kabu1204/YCSB-cpp][forked YCSB-cpp]]                                                

* TODO check
** TODO src code
** DONE default config [2/2]
- State "DONE"       from "TODO"       [2023-02-22 Wed 11:18] \\
  rocksdb: bloom bits 10 is recommended in both header and wiki.
  wiredtiger: block compressor snappy
- [X] rocksdb
- [X] wiredtiger

* RocksDB settings
#+ATTR_LATEX: :environment longtable :align l|lp{3cm}r|l
| Properties                                 |     Value | Remark                            |
|--------------------------------------------+-----------+-----------------------------------|
| rocksdb.compression                        |    snappy |                                   |
| rocksdb.max_background_jobs                |         2 |                                   |
| rocksdb.target_file_size_base              |  67108864 | 64MB                              |
| rocksdb.target_file_size_multiplier        |         1 |                                   |
| rocksdb.max_bytes_for_level_base           | 268435456 | 256MB                             |
| rocksdb.write_buffer_size                  |  67108864 | 64MB                              |
| rocksdb.max_open_files                     |        -1 | files opened are always kept open |
| rocksdb.max_write_buffer_number            |         2 |                                   |
| rocksdb.use_direct_io_for_flush_compaction |     false |                                   |
| rocksdb.use_direct_reads                   |     false |                                   |
| rocksdb.allow_mmap_writes                  |     false |                                   |
| rocksdb.allow_mmap_reads                   |     false |                                   |
| rocksdb.cache_size                         |   8388608 | 8MB                               |
| rocksdb.compressed_cache_size              |         0 |                                   |
| rocksdb.bloom_bits                         |        10 |                                   |
| rocksdb.increase_parallelism               |     false |                                   |
| rocksdb.optimize_level_style_compaction    |     false |                                   |

** Terminology
#+ATTR_LATEX: :environment longtable :align l|lp{3cm}r|l
| Term                     | Description                                                                |
|--------------------------+----------------------------------------------------------------------------|
| block cache              | in-memory data structure that cache the hot data blocks from the SST files |
| target_file_size_base    | target_file_size_base is per-file size for level1, in bytes                |
| max_bytes_for_level_base | max size for level1, in bytes                                              |
| write buffer             | memtable                                                                   |

