ycsb.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-02-25 Sat 18:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="于承业" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org9f83fe8">1. Testbed</a></li>
<li><a href="#orgfe08114">2. <span class="todo TODO">TODO</span> check</a>
<ul>
<li><a href="#org5be0976">2.1. <span class="todo TODO">TODO</span> src code</a></li>
<li><a href="#org47fbd5a">2.2. <span class="done DONE">DONE</span> default config <code>[2/2]</code></a></li>
</ul>
</li>
<li><a href="#orga898833">3. RocksDB settings</a>
<ul>
<li><a href="#orgc5cb848">3.1. Terminology</a></li>
</ul>
</li>
<li><a href="#org0179cfb">4. WiredTiger settings</a></li>
<li><a href="#orge85eee8">5. Bench</a>
<ul>
<li><a href="#org6d5ae59">5.1. General</a></li>
<li><a href="#org1908f0c">5.2. Load</a></li>
<li><a href="#orga769f57">5.3. Run Workerload A (UPDATE heavy | UPDATE:READ=0.95:0.05)</a></li>
<li><a href="#org2be3614">5.4. Run Workerload B (READ most | READ:UPDATE=0.95:0.05)</a></li>
<li><a href="#org7513c46">5.5. Run Workerload C (READ only)</a></li>
<li><a href="#orgf00c043">5.6. Run Workerload D (READ lastest | READ:INSERT=0.95:0.05)</a></li>
<li><a href="#org32c22bb">5.7. Run Workerload E (SCAN heavy | SCAN:INSERT=0.95:0.05)</a></li>
<li><a href="#org345f289">5.8. Run Workerload F(Read-Modify-Update | READ:WRITE=1.5:1)</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org9f83fe8" class="outline-2">
<h2 id="org9f83fe8"><span class="section-number-2">1.</span> Testbed</h2>
<div class="outline-text-2" id="text-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">OS</td>
<td class="org-left">Windows10 x86_64</td>
</tr>

<tr>
<td class="org-left">CPU</td>
<td class="org-left">AMD Ryzen 5 5600 @ 3892.7MHz</td>
</tr>

<tr>
<td class="org-left">MEM</td>
<td class="org-left">DDR4 16G 3200MHz</td>
</tr>

<tr>
<td class="org-left">Filesystem</td>
<td class="org-left">NTFS</td>
</tr>

<tr>
<td class="org-left">Disk</td>
<td class="org-left">PCIE3.0 NVMe SSD (73000 4K RANDOM WRITE IOPS ; 300MB/s 256K RANDOM WRITE BW ; 30000 4K RANDOM READ IOPS ; 1300MB/s 256K RANDOM READ BW)</td>
</tr>

<tr>
<td class="org-left">Repo</td>
<td class="org-left"><a href="https://github.com/kabu1204/YCSB-cpp">forked YCSB-cpp</a></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgfe08114" class="outline-2">
<h2 id="orgfe08114"><span class="section-number-2">2.</span> <span class="todo TODO">TODO</span> check</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org5be0976" class="outline-3">
<h3 id="org5be0976"><span class="section-number-3">2.1.</span> <span class="todo TODO">TODO</span> src code</h3>
</div>
<div id="outline-container-org47fbd5a" class="outline-3">
<h3 id="org47fbd5a"><span class="section-number-3">2.2.</span> <span class="done DONE">DONE</span> default config <code>[2/2]</code></h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>State "DONE"       from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2023-02-22 Wed 11:18] </span></span> <br />
rocksdb: bloom bits 10 is recommended in both header and wiki.
wiredtiger: block compressor snappy</li>
<li class="on"><code>[X]</code> rocksdb</li>
<li class="on"><code>[X]</code> wiredtiger</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orga898833" class="outline-2">
<h2 id="orga898833"><span class="section-number-2">3.</span> RocksDB settings</h2>
<div class="outline-text-2" id="text-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Properties</th>
<th scope="col" class="org-right">Value</th>
<th scope="col" class="org-left">Remark</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">rocksdb.compression</td>
<td class="org-right">snappy</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">rocksdb.max_background_jobs</td>
<td class="org-right">2</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">rocksdb.target_file_size_base</td>
<td class="org-right">67108864</td>
<td class="org-left">64MB</td>
</tr>

<tr>
<td class="org-left">rocksdb.target_file_size_multiplier</td>
<td class="org-right">1</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">rocksdb.max_bytes_for_level_base</td>
<td class="org-right">268435456</td>
<td class="org-left">256MB</td>
</tr>

<tr>
<td class="org-left">rocksdb.write_buffer_size</td>
<td class="org-right">67108864</td>
<td class="org-left">64MB</td>
</tr>

<tr>
<td class="org-left">rocksdb.max_open_files</td>
<td class="org-right">-1</td>
<td class="org-left">files opened are always kept open</td>
</tr>

<tr>
<td class="org-left">rocksdb.max_write_buffer_number</td>
<td class="org-right">2</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">rocksdb.use_direct_io_for_flush_compaction</td>
<td class="org-right">false</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">rocksdb.use_direct_reads</td>
<td class="org-right">false</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">rocksdb.allow_mmap_writes</td>
<td class="org-right">false</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">rocksdb.allow_mmap_reads</td>
<td class="org-right">false</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">rocksdb.cache_size</td>
<td class="org-right">8388608</td>
<td class="org-left">8MB</td>
</tr>

<tr>
<td class="org-left">rocksdb.compressed_cache_size</td>
<td class="org-right">0</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">rocksdb.bloom_bits</td>
<td class="org-right">10</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">rocksdb.increase_parallelism</td>
<td class="org-right">false</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">rocksdb.optimize_level_style_compaction</td>
<td class="org-right">false</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-orgc5cb848" class="outline-3">
<h3 id="orgc5cb848"><span class="section-number-3">3.1.</span> Terminology</h3>
<div class="outline-text-3" id="text-3-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Term</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">block cache</td>
<td class="org-left">in-memory data structure that cache the hot data blocks from the SST files</td>
</tr>

<tr>
<td class="org-left">target_file_size_base</td>
<td class="org-left">target_file_size_base is per-file size for level1, in bytes</td>
</tr>

<tr>
<td class="org-left">max_bytes_for_level_base</td>
<td class="org-left">max size for level1, in bytes</td>
</tr>

<tr>
<td class="org-left">write buffer</td>
<td class="org-left">memtable</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
