ycsb.org
* WiredTiger settings
#+ATTR_LATEX: :environment longtable :align l|lp{3cm}r|l
| Properties                                 | Value  | Remark                                                      |
|--------------------------------------------+--------+-------------------------------------------------------------|
| wiredtiger.cache_size                      | 100MB  | For BTree ONLY, including associated in-mem data structures |
| wiredtiger.direct_io                       | []     |                                                             |
| wiredtiger.in_memory                       | false  |                                                             |
| wiredtiger.lsm_mgr.merge                   | true   |                                                             |
| wiredtiger.lsm_mgr.max_workers             | 4      | # of threads doing background merging                       |
| wiredtiger.blk_mgr.allocation_size         | 4KB    | OS PAGE_SIZE                                                |
| wiredtiger.blk_mgr.bloom_bit_count         | 16     | per key                                                     |
| wiredtiger.blk_mgr.bloom_hash_count        | 8      |                                                             |
| wiredtiger.blk_mgr.chunk_max               | 5GB    |                                                             |
| wiredtiger.blk_mgr.chunk_size              | 10MB   |                                                             |
| wiredtiger.blk_mgr.compressor              | snappy |                                                             |
| wiredtiger.blk_mgr.btree.internal_page_max | 4KB    |                                                             |
| wiredtiger.blk_mgr.btree.leaf_key_max      | 0      | 1/10 the size of a newly split page                         |
| wiredtiger.blk_mgr.btree.leaf_value_max    | 0      | 1/2 the size a newly split page                             |
| wiredtiger.blk_mgr.btree.leaf_page_max     | 32KB   |                                                             |

* Bench

** General
#+ATTR_LATEX: :environment longtable :align l|lp{3cm}r|l
| Key size | Value size | Record count    | Operation count | thread count |
|----------+------------+-----------------+-----------------+--------------|
| 8B       | 24B        | 1G (10M for wt) | 100M            |            8 |

#+begin_src bash
  ./ycsb -run -db rocksdb -P workloads/workloadf -P rocksdb/rocksdb.properties -s \
-p fixedkey8b=true -p fixedfieldlen=true -p fieldcount=1 -p fieldlength=24 \
-p recordcount=1000000000 -p operationcount=100000000 -p threadcount=8
#+end_src

** Load
#+ATTR_LATEX: :environment longtable :align l|lp{3cm}r|l
| DB                | Load runtime(sec) | Load throughput(ops/sec) |      Max |  Min | Avg(us) |     90 |      99 |     99.9 |    99.99 |
|-------------------+-------------------+--------------------------+----------+------+---------+--------+---------+----------+----------|
| RocksDB-INSERT    |           5669.34 | 176,387                  | 32079.87 | 4.40 |   44.93 |  20.02 |   31.90 | 14254.08 | 15114.24 |
| WiredTiger-INSERT |           676.592 | 14,780                   | 56492.03 | 0.57 |  532.24 | 974.85 | 7712.77 | 16039.93 | 24297.47 |


