ycsb.html

<div id="outline-container-org0179cfb" class="outline-2">
<h2 id="org0179cfb"><span class="section-number-2">4.</span> WiredTiger settings</h2>
<div class="outline-text-2" id="text-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Properties</th>
<th scope="col" class="org-left">Value</th>
<th scope="col" class="org-left">Remark</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">wiredtiger.cache_size</td>
<td class="org-left">100MB</td>
<td class="org-left">For BTree ONLY, including associated in-mem data structures</td>
</tr>

<tr>
<td class="org-left">wiredtiger.direct_io</td>
<td class="org-left">[]</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">wiredtiger.in_memory</td>
<td class="org-left">false</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">wiredtiger.lsm_mgr.merge</td>
<td class="org-left">true</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">wiredtiger.lsm_mgr.max_workers</td>
<td class="org-left">4</td>
<td class="org-left"># of threads doing background merging</td>
</tr>

<tr>
<td class="org-left">wiredtiger.blk_mgr.allocation_size</td>
<td class="org-left">4KB</td>
<td class="org-left">OS PAGE_SIZE</td>
</tr>

<tr>
<td class="org-left">wiredtiger.blk_mgr.bloom_bit_count</td>
<td class="org-left">16</td>
<td class="org-left">per key</td>
</tr>

<tr>
<td class="org-left">wiredtiger.blk_mgr.bloom_hash_count</td>
<td class="org-left">8</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">wiredtiger.blk_mgr.chunk_max</td>
<td class="org-left">5GB</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">wiredtiger.blk_mgr.chunk_size</td>
<td class="org-left">10MB</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">wiredtiger.blk_mgr.compressor</td>
<td class="org-left">snappy</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">wiredtiger.blk_mgr.btree.internal_page_max</td>
<td class="org-left">4KB</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">wiredtiger.blk_mgr.btree.leaf_key_max</td>
<td class="org-left">0</td>
<td class="org-left">1/10 the size of a newly split page</td>
</tr>

<tr>
<td class="org-left">wiredtiger.blk_mgr.btree.leaf_value_max</td>
<td class="org-left">0</td>
<td class="org-left">1/2 the size a newly split page</td>
</tr>

<tr>
<td class="org-left">wiredtiger.blk_mgr.btree.leaf_page_max</td>
<td class="org-left">32KB</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orge85eee8" class="outline-2">
<h2 id="orge85eee8"><span class="section-number-2">5.</span> Bench</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org6d5ae59" class="outline-3">
<h3 id="org6d5ae59"><span class="section-number-3">5.1.</span> General</h3>
<div class="outline-text-3" id="text-5-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key size</th>
<th scope="col" class="org-left">Value size</th>
<th scope="col" class="org-left">Record count</th>
<th scope="col" class="org-left">Operation count</th>
<th scope="col" class="org-right">thread count</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">8B</td>
<td class="org-left">24B</td>
<td class="org-left">1G (10M for wt)</td>
<td class="org-left">100M</td>
<td class="org-right">8</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-bash">  ./ycsb -run -db rocksdb -P workloads/workloadf -P rocksdb/rocksdb.properties -s <span style="color: #8b008b;">\</span>
-p <span style="color: #a0522d;">fixedkey8b</span>=true -p <span style="color: #a0522d;">fixedfieldlen</span>=true -p <span style="color: #a0522d;">fieldcount</span>=1 -p <span style="color: #a0522d;">fieldlength</span>=24 <span style="color: #8b008b;">\</span>
-p <span style="color: #a0522d;">recordcount</span>=1000000000 -p <span style="color: #a0522d;">operationcount</span>=100000000 -p <span style="color: #a0522d;">threadcount</span>=8
</pre>
</div>
</div>
</div>

<div id="outline-container-org1908f0c" class="outline-3">
<h3 id="org1908f0c"><span class="section-number-3">5.2.</span> Load</h3>
<div class="outline-text-3" id="text-5-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">DB</th>
<th scope="col" class="org-right">Load runtime(sec)</th>
<th scope="col" class="org-left">Load throughput(ops/sec)</th>
<th scope="col" class="org-right">Max</th>
<th scope="col" class="org-right">Min</th>
<th scope="col" class="org-right">Avg(us)</th>
<th scope="col" class="org-right">90</th>
<th scope="col" class="org-right">99</th>
<th scope="col" class="org-right">99.9</th>
<th scope="col" class="org-right">99.99</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">RocksDB-INSERT</td>
<td class="org-right">5669.34</td>
<td class="org-left">176,387</td>
<td class="org-right">32079.87</td>
<td class="org-right">4.40</td>
<td class="org-right">44.93</td>
<td class="org-right">20.02</td>
<td class="org-right">31.90</td>
<td class="org-right">14254.08</td>
<td class="org-right">15114.24</td>
</tr>

<tr>
<td class="org-left">WiredTiger-INSERT</td>
<td class="org-right">676.592</td>
<td class="org-left">14,780</td>
<td class="org-right">56492.03</td>
<td class="org-right">0.57</td>
<td class="org-right">532.24</td>
<td class="org-right">974.85</td>
<td class="org-right">7712.77</td>
<td class="org-right">16039.93</td>
<td class="org-right">24297.47</td>
</tr>
</tbody>
</table>
</div>
</div>
