ycsb.org
** Run Workerload A (UPDATE heavy | UPDATE:READ=0.95:0.05)
| DB         | Run runtime(sec) | Run throughput(ops/sec) |
|------------+------------------+-------------------------|
| RocksDB    |          1267.29 | 78,908                  |
| WiredTiger |           373.14 | 26,799                  |

| DB                |       Max |  Min | Avg(us) |     90 |      99 |     99.9 |    99.99 |
|-------------------+-----------+------+---------+--------+---------+----------+----------|
| RocksDB-UPDATE    | 201719.81 | 4.50 |  105.02 | 273.41 |  908.29 |  2920.45 |  5509.12 |
| RocksDB-READ      | 203030.53 | 0.30 |   95.30 | 261.12 |  896.00 |  2902.01 |  5414.91 |
| Wiredtiger-UPDATE |  54329.34 | 0.95 |  297.49 | 522.24 | 3448.83 | 14852.09 | 24461.31 |
| WiredTiger-READ   |  52527.10 | 0.26 |  293.46 | 514.05 | 3403.78 | 14745.60 | 24379.39 |


** Run Workerload B (READ most | READ:UPDATE=0.95:0.05)
| DB         | Run runtime(sec) | Run throughput(ops/sec) |
|------------+------------------+-------------------------|
| RocksDB    |          1113.47 | 89,810                  |
| WiredTiger |          152.114 | 65,740                  |

| DB                |      Max |  Min | Avg(us) |     90 |     99 |    99.9 |    99.99 |
|-------------------+----------+------+---------+--------+--------+---------+----------|
| RocksDB-UPDATE    | 18022.40 | 5.00 |   99.50 | 276.99 | 603.65 | 2217.98 |  3205.12 |
| RocksDB-READ      | 32063.49 | 0.30 |   87.75 | 263.94 | 591.87 | 2207.74 |  3170.30 |
| Wiredtiger-UPDATE | 19251.20 | 1.05 |  130.26 | 225.79 | 575.49 | 3772.41 | 10911.74 |
| WiredTiger-READ   | 24903.68 | 0.22 |  118.51 | 219.90 | 374.01 | 2748.79 |  8749.06 |


