ycsb.html


<div id="outline-container-orga769f57" class="outline-3">
<h3 id="orga769f57"><span class="section-number-3">5.3.</span> Run Workerload A (UPDATE heavy | UPDATE:READ=0.95:0.05)</h3>
<div class="outline-text-3" id="text-5-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">DB</th>
<th scope="col" class="org-right">Run runtime(sec)</th>
<th scope="col" class="org-left">Run throughput(ops/sec)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">RocksDB</td>
<td class="org-right">1267.29</td>
<td class="org-left">78,908</td>
</tr>

<tr>
<td class="org-left">WiredTiger</td>
<td class="org-right">373.14</td>
<td class="org-left">26,799</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">DB</th>
<th scope="col" class="org-right">Max</th>
<th scope="col" class="org-right">Min</th>
<th scope="col" class="org-right">Avg(us)</th>
<th scope="col" class="org-right">90</th>
<th scope="col" class="org-right">99</th>
<th scope="col" class="org-right">99.9</th>
<th scope="col" class="org-right">99.99</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">RocksDB-UPDATE</td>
<td class="org-right">201719.81</td>
<td class="org-right">4.50</td>
<td class="org-right">105.02</td>
<td class="org-right">273.41</td>
<td class="org-right">908.29</td>
<td class="org-right">2920.45</td>
<td class="org-right">5509.12</td>
</tr>

<tr>
<td class="org-left">RocksDB-READ</td>
<td class="org-right">203030.53</td>
<td class="org-right">0.30</td>
<td class="org-right">95.30</td>
<td class="org-right">261.12</td>
<td class="org-right">896.00</td>
<td class="org-right">2902.01</td>
<td class="org-right">5414.91</td>
</tr>

<tr>
<td class="org-left">Wiredtiger-UPDATE</td>
<td class="org-right">54329.34</td>
<td class="org-right">0.95</td>
<td class="org-right">297.49</td>
<td class="org-right">522.24</td>
<td class="org-right">3448.83</td>
<td class="org-right">14852.09</td>
<td class="org-right">24461.31</td>
</tr>

<tr>
<td class="org-left">WiredTiger-READ</td>
<td class="org-right">52527.10</td>
<td class="org-right">0.26</td>
<td class="org-right">293.46</td>
<td class="org-right">514.05</td>
<td class="org-right">3403.78</td>
<td class="org-right">14745.60</td>
<td class="org-right">24379.39</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-org2be3614" class="outline-3">
<h3 id="org2be3614"><span class="section-number-3">5.4.</span> Run Workerload B (READ most | READ:UPDATE=0.95:0.05)</h3>
<div class="outline-text-3" id="text-5-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">DB</th>
<th scope="col" class="org-right">Run runtime(sec)</th>
<th scope="col" class="org-left">Run throughput(ops/sec)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">RocksDB</td>
<td class="org-right">1113.47</td>
<td class="org-left">89,810</td>
</tr>

<tr>
<td class="org-left">WiredTiger</td>
<td class="org-right">152.114</td>
<td class="org-left">65,740</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">DB</th>
<th scope="col" class="org-right">Max</th>
<th scope="col" class="org-right">Min</th>
<th scope="col" class="org-right">Avg(us)</th>
<th scope="col" class="org-right">90</th>
<th scope="col" class="org-right">99</th>
<th scope="col" class="org-right">99.9</th>
<th scope="col" class="org-right">99.99</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">RocksDB-UPDATE</td>
<td class="org-right">18022.40</td>
<td class="org-right">5.00</td>
<td class="org-right">99.50</td>
<td class="org-right">276.99</td>
<td class="org-right">603.65</td>
<td class="org-right">2217.98</td>
<td class="org-right">3205.12</td>
</tr>

<tr>
<td class="org-left">RocksDB-READ</td>
<td class="org-right">32063.49</td>
<td class="org-right">0.30</td>
<td class="org-right">87.75</td>
<td class="org-right">263.94</td>
<td class="org-right">591.87</td>
<td class="org-right">2207.74</td>
<td class="org-right">3170.30</td>
</tr>

<tr>
<td class="org-left">Wiredtiger-UPDATE</td>
<td class="org-right">19251.20</td>
<td class="org-right">1.05</td>
<td class="org-right">130.26</td>
<td class="org-right">225.79</td>
<td class="org-right">575.49</td>
<td class="org-right">3772.41</td>
<td class="org-right">10911.74</td>
</tr>

<tr>
<td class="org-left">WiredTiger-READ</td>
<td class="org-right">24903.68</td>
<td class="org-right">0.22</td>
<td class="org-right">118.51</td>
<td class="org-right">219.90</td>
<td class="org-right">374.01</td>
<td class="org-right">2748.79</td>
<td class="org-right">8749.06</td>
</tr>
</tbody>
</table>
</div>
</div>
