ycsb.org
** Run Workerload C (READ only)
| DB         | Run runtime(sec) | Run throughput(ops/sec) |
|------------+------------------+-------------------------|
| RocksDB    |          1113.11 | 89,837                  |
| WiredTiger |           127.54 | 78,407                  |

| DB              |      Max |  Min | Avg(us) |     90 |     99 |    99.9 |   99.99 |
|-----------------+----------+------+---------+--------+--------+---------+---------|
| RocksDB-READ    | 93061.12 | 1.20 |   88.31 | 264.70 | 515.58 | 1478.65 | 4313.09 |
| WiredTiger-READ | 14417.92 | 0.20 |  100.05 | 214.53 | 256.13 |  673.79 | 1638.40 |


** Run Workerload D (READ lastest | READ:INSERT=0.95:0.05)
| DB         | Run runtime(sec) | Run throughput(ops/sec) |
|------------+------------------+-------------------------|
| RocksDB    |          446.869 | 223,779                 |
| WiredTiger |          133.523 | 74,893                  |

| DB                |      Max |  Min | Avg(us) |     90 |     99 |    99.9 |    99.99 |
|-------------------+----------+------+---------+--------+--------+---------+----------|
| RocksDB-INSERT    |  6078.46 | 4.20 |   11.75 |  15.61 |  22.63 |   29.50 |    78.91 |
| RocksDB-READ      | 30605.31 | 0.20 |   36.29 | 123.71 | 409.34 | 2026.49 |  2951.17 |
| Wiredtiger-INSERT | 19218.43 | 2.20 |  172.26 | 245.25 | 914.94 | 3348.48 | 10280.96 |
| WiredTiger-READ   | 21200.90 | 0.24 |  101.55 | 220.29 | 407.55 | 2729.98 |  8699.90 |


