ycsb.html


<div id="outline-container-org7513c46" class="outline-3">
<h3 id="org7513c46"><span class="section-number-3">5.5.</span> Run Workerload C (READ only)</h3>
<div class="outline-text-3" id="text-5-5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">DB</th>
<th scope="col" class="org-right">Run runtime(sec)</th>
<th scope="col" class="org-left">Run throughput(ops/sec)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">RocksDB</td>
<td class="org-right">1113.11</td>
<td class="org-left">89,837</td>
</tr>

<tr>
<td class="org-left">WiredTiger</td>
<td class="org-right">127.54</td>
<td class="org-left">78,407</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">DB</th>
<th scope="col" class="org-right">Max</th>
<th scope="col" class="org-right">Min</th>
<th scope="col" class="org-right">Avg(us)</th>
<th scope="col" class="org-right">90</th>
<th scope="col" class="org-right">99</th>
<th scope="col" class="org-right">99.9</th>
<th scope="col" class="org-right">99.99</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">RocksDB-READ</td>
<td class="org-right">93061.12</td>
<td class="org-right">1.20</td>
<td class="org-right">88.31</td>
<td class="org-right">264.70</td>
<td class="org-right">515.58</td>
<td class="org-right">1478.65</td>
<td class="org-right">4313.09</td>
</tr>

<tr>
<td class="org-left">WiredTiger-READ</td>
<td class="org-right">14417.92</td>
<td class="org-right">0.20</td>
<td class="org-right">100.05</td>
<td class="org-right">214.53</td>
<td class="org-right">256.13</td>
<td class="org-right">673.79</td>
<td class="org-right">1638.40</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-orgf00c043" class="outline-3">
<h3 id="orgf00c043"><span class="section-number-3">5.6.</span> Run Workerload D (READ lastest | READ:INSERT=0.95:0.05)</h3>
<div class="outline-text-3" id="text-5-6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">DB</th>
<th scope="col" class="org-right">Run runtime(sec)</th>
<th scope="col" class="org-left">Run throughput(ops/sec)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">RocksDB</td>
<td class="org-right">446.869</td>
<td class="org-left">223,779</td>
</tr>

<tr>
<td class="org-left">WiredTiger</td>
<td class="org-right">133.523</td>
<td class="org-left">74,893</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">DB</th>
<th scope="col" class="org-right">Max</th>
<th scope="col" class="org-right">Min</th>
<th scope="col" class="org-right">Avg(us)</th>
<th scope="col" class="org-right">90</th>
<th scope="col" class="org-right">99</th>
<th scope="col" class="org-right">99.9</th>
<th scope="col" class="org-right">99.99</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">RocksDB-INSERT</td>
<td class="org-right">6078.46</td>
<td class="org-right">4.20</td>
<td class="org-right">11.75</td>
<td class="org-right">15.61</td>
<td class="org-right">22.63</td>
<td class="org-right">29.50</td>
<td class="org-right">78.91</td>
</tr>

<tr>
<td class="org-left">RocksDB-READ</td>
<td class="org-right">30605.31</td>
<td class="org-right">0.20</td>
<td class="org-right">36.29</td>
<td class="org-right">123.71</td>
<td class="org-right">409.34</td>
<td class="org-right">2026.49</td>
<td class="org-right">2951.17</td>
</tr>

<tr>
<td class="org-left">Wiredtiger-INSERT</td>
<td class="org-right">19218.43</td>
<td class="org-right">2.20</td>
<td class="org-right">172.26</td>
<td class="org-right">245.25</td>
<td class="org-right">914.94</td>
<td class="org-right">3348.48</td>
<td class="org-right">10280.96</td>
</tr>

<tr>
<td class="org-left">WiredTiger-READ</td>
<td class="org-right">21200.90</td>
<td class="org-right">0.24</td>
<td class="org-right">101.55</td>
<td class="org-right">220.29</td>
<td class="org-right">407.55</td>
<td class="org-right">2729.98</td>
<td class="org-right">8699.90</td>
</tr>
</tbody>
</table>
</div>
</div>
