ycsb.org
** Run Workerload E (SCAN heavy | SCAN:INSERT=0.95:0.05)
| DB         | Run runtime(sec) | Run throughput(ops/sec) |
|------------+------------------+-------------------------|
| RocksDB    |          1000.00 | 49,308                  |
| WiredTiger |          158.148 | 63,232                  |

| DB                |      Max |  Min | Avg(us) |     90 |     99 |    99.9 |    99.99 |
|-------------------+----------+------+---------+--------+--------+---------+----------|
| RocksDB-INSERT    |  3143.68 | 4.30 |   14.34 |  17.50 |  24.21 |   31.61 |    81.86 |
| RocksDB-SCAN      | 41123.84 | 5.70 |  167.98 | 380.67 | 708.61 | 2022.40 |  3336.19 |
| Wiredtiger-INSERT | 20234.24 | 2.15 |  162.22 | 239.49 | 807.42 | 4093.95 | 13197.31 |
| WiredTiger-SCAN   | 30064.62 | 0.25 |  121.98 | 231.55 | 329.21 | 2684.93 | 10616.83 |


** Run Workerload F(Read-Modify-Update | READ:WRITE=1.5:1)
| DB                               | Run runtime(sec) | Run throughput(ops/sec) |
|----------------------------------+------------------+-------------------------|
| RocksDB(actually 1.5G records)   |          1192.88 | 125,843                 |
| WiredTiger(actually 15M records) |          355.461 | 42,204                  |

| DB                |      Max |  Min | Avg(us) |     90 |      99 |     99.9 |    99.99 |
|-------------------+----------+------+---------+--------+---------+----------+----------|
| RocksDB-READ      | 62226.43 | 0.30 |   87.69 | 242.69 |  685.57 |  2836.48 |  5316.61 |
| RocksDB-UPDATE    | 11034.62 | 4.30 |   13.26 |  20.91 |   28.51 |    37.50 |    91.84 |
| Wiredtiger-READ   | 50200.57 | 0.22 |  279.12 | 270.33 | 4042.75 | 15335.42 | 24887.29 |
| WiredTiger-UPDATE | 27394.05 | 0.72 |    4.32 |   4.51 |    7.17 |    35.42 |  2942.97 |
