ycsb.md


<a id="org124f1ec"></a>

## Run Workerload E (SCAN heavy | SCAN:INSERT=0.95:0.05)

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">DB</th>
<th scope="col" class="org-right">Run runtime(sec)</th>
<th scope="col" class="org-left">Run throughput(ops/sec)</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">RocksDB</td>
<td class="org-right">1000.00</td>
<td class="org-left">49,308</td>
</tr>


<tr>
<td class="org-left">WiredTiger</td>
<td class="org-right">158.148</td>
<td class="org-left">63,232</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">DB</th>
<th scope="col" class="org-right">Max</th>
<th scope="col" class="org-right">Min</th>
<th scope="col" class="org-right">Avg(us)</th>
<th scope="col" class="org-right">90</th>
<th scope="col" class="org-right">99</th>
<th scope="col" class="org-right">99.9</th>
<th scope="col" class="org-right">99.99</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">RocksDB-INSERT</td>
<td class="org-right">3143.68</td>
<td class="org-right">4.30</td>
<td class="org-right">14.34</td>
<td class="org-right">17.50</td>
<td class="org-right">24.21</td>
<td class="org-right">31.61</td>
<td class="org-right">81.86</td>
</tr>


<tr>
<td class="org-left">RocksDB-SCAN</td>
<td class="org-right">41123.84</td>
<td class="org-right">5.70</td>
<td class="org-right">167.98</td>
<td class="org-right">380.67</td>
<td class="org-right">708.61</td>
<td class="org-right">2022.40</td>
<td class="org-right">3336.19</td>
</tr>


<tr>
<td class="org-left">Wiredtiger-INSERT</td>
<td class="org-right">20234.24</td>
<td class="org-right">2.15</td>
<td class="org-right">162.22</td>
<td class="org-right">239.49</td>
<td class="org-right">807.42</td>
<td class="org-right">4093.95</td>
<td class="org-right">13197.31</td>
</tr>


<tr>
<td class="org-left">WiredTiger-SCAN</td>
<td class="org-right">30064.62</td>
<td class="org-right">0.25</td>
<td class="org-right">121.98</td>
<td class="org-right">231.55</td>
<td class="org-right">329.21</td>
<td class="org-right">2684.93</td>
<td class="org-right">10616.83</td>
</tr>
</tbody>
</table>


<a id="orgd9549b9"></a>

## Run Workerload F(Read-Modify-Update | READ:WRITE=1.5:1)

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">DB</th>
<th scope="col" class="org-right">Run runtime(sec)</th>
<th scope="col" class="org-left">Run throughput(ops/sec)</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">RocksDB(actually 1.5G records)</td>
<td class="org-right">1192.88</td>
<td class="org-left">125,843</td>
</tr>


<tr>
<td class="org-left">WiredTiger(actually 15M records)</td>
<td class="org-right">355.461</td>
<td class="org-left">42,204</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">DB</th>
<th scope="col" class="org-right">Max</th>
<th scope="col" class="org-right">Min</th>
<th scope="col" class="org-right">Avg(us)</th>
<th scope="col" class="org-right">90</th>
<th scope="col" class="org-right">99</th>
<th scope="col" class="org-right">99.9</th>
<th scope="col" class="org-right">99.99</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">RocksDB-READ</td>
<td class="org-right">62226.43</td>
<td class="org-right">0.30</td>
<td class="org-right">87.69</td>
<td class="org-right">242.69</td>
<td class="org-right">685.57</td>
<td class="org-right">2836.48</td>
<td class="org-right">5316.61</td>
</tr>


<tr>
<td class="org-left">RocksDB-UPDATE</td>
<td class="org-right">11034.62</td>
<td class="org-right">4.30</td>
<td class="org-right">13.26</td>
<td class="org-right">20.91</td>
<td class="org-right">28.51</td>
<td class="org-right">37.50</td>
<td class="org-right">91.84</td>
</tr>


<tr>
<td class="org-left">Wiredtiger-READ</td>
<td class="org-right">50200.57</td>
<td class="org-right">0.22</td>
<td class="org-right">279.12</td>
<td class="org-right">270.33</td>
<td class="org-right">4042.75</td>
<td class="org-right">15335.42</td>
<td class="org-right">24887.29</td>
</tr>


<tr>
<td class="org-left">WiredTiger-UPDATE</td>
<td class="org-right">27394.05</td>
<td class="org-right">0.72</td>
<td class="org-right">4.32</td>
<td class="org-right">4.51</td>
<td class="org-right">7.17</td>
<td class="org-right">35.42</td>
<td class="org-right">2942.97</td>
</tr>
</tbody>
</table>

